<!-- dflook/terraform-github-actions {"workspace":"staging","backend_type":"s3","label":"staging","backend":"8dc813f2d45c4a4aaf53aaaf39e6dc3c41bbd3d2ac6ad475bd3c997e1bcacb62","plan_job_ref":"Job plan #13 at https://github.com/GSA/usnotify-ssb/actions/runs/4823206021","plan_hash":"2f16298fd129adff78c73df6c5e65ad6a4c54f663e37c56de334e81c468fa5d0","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 2 to add, 8 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.broker_sms.cloudfoundry_app.ssb must be replaced
-/+ resource "cloudfoundry_app" "ssb" {
      + health_check_http_endpoint = (known after apply)
      ~ health_check_timeout       = 0 -> (known after apply)
      ~ id                         = "************************************" -> (known after apply)
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-sms"
      ~ ports                      = [
          - 8080,
        ] -> (known after apply)
      ~ source_code_hash           = "SlpDWmhT0gDD8n9zIOvo9Hz/L9uqtEUVNetAjHnZ6g0=" -> "Azau63OizjMPWBKlG+JGVKz6I48LdURxiTCOOxPZBzA="
      ~ stack                      = "ad34309f-ab24-4c3d-9ad1-eb0da8378bd4" -> "793876df-45b2-43cc-adcd-ccf88fea63f5" # forces replacement
        # (13 unchanged attributes hidden)

      - routes {
          - port  = 8080 -> null
          - route = "3d524868-7061-4ab6-8048-c97c775df9a9" -> null
        }
      + routes {
          + port  = (known after apply)
          + route = "3d524868-7061-4ab6-8048-c97c775df9a9"
        }

      ~ service_binding {
          - params           = (sensitive value) -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-demo"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "5ee0d213-483d-416d-9eb1-76f0c8348193"
        name                             = "ssb-sms-gsa-tts-benefits-studio-prototyping-notify-demo"
        # (8 unchanged attributes hidden)
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-management-staging"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "41c1036b-ee10-4aac-b208-5f23f6518125"
        name                             = "ssb-sms-gsa-tts-benefits-studio-prototyping-notify-management-staging"
        # (8 unchanged attributes hidden)
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-sandbox"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "9bbc73f6-f8bf-419e-a147-04c4e98d001e"
        name                             = "ssb-sms-gsa-tts-benefits-studio-prototyping-notify-sandbox"
        # (8 unchanged attributes hidden)
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-staging"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "203e6fa1-f100-4a22-93bb-ae6492d93e36"
        name                             = "ssb-sms-gsa-tts-benefits-studio-prototyping-notify-staging"
        # (8 unchanged attributes hidden)
    }

  # module.broker_smtp.cloudfoundry_app.ssb must be replaced
-/+ resource "cloudfoundry_app" "ssb" {
      + health_check_http_endpoint = (known after apply)
      ~ health_check_timeout       = 0 -> (known after apply)
      ~ id                         = "************************************" -> (known after apply)
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-smtp"
      ~ ports                      = [
          - 8080,
        ] -> (known after apply)
      ~ source_code_hash           = "ULiD8aKL0bK+/ZSMAP6hktxfsnol1ppgx7HAMDCCSZs=" -> "OfGBYaIM6hHzeGqV0dDVPgkeozKZDgjBx0hkCzOK2sc="
      ~ stack                      = "ad34309f-ab24-4c3d-9ad1-eb0da8378bd4" -> "793876df-45b2-43cc-adcd-ccf88fea63f5" # forces replacement
        # (13 unchanged attributes hidden)

      - routes {
          - port  = 8080 -> null
          - route = "4dde2fc3-7d82-4c81-8e92-d4920fcd4510" -> null
        }
      + routes {
          + port  = (known after apply)
          + route = "4dde2fc3-7d82-4c81-8e92-d4920fcd4510"
        }

      ~ service_binding {
          - params           = (sensitive value) -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-demo"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "05471952-9898-4237-b2d9-40f111ab018e"
        name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-demo"
        # (8 unchanged attributes hidden)
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-management-staging"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "3096b0f1-3037-47cf-9e8e-3e700db2d580"
        name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-management-staging"
        # (8 unchanged attributes hidden)
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-sandbox"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "52e2616e-7bc3-4d68-81b8-25865a20c736"
        name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-sandbox"
        # (8 unchanged attributes hidden)
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-staging"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "b2536b75-2d3b-4a5a-aaa9-bda36761235c"
        name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-staging"
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 8 to change, 2 to destroy.
```
</details>

:white_check_mark: Plan applied in [apply #14](https://github.com/GSA/usnotify-ssb/actions/runs/4824362535)